yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
/*
 *  STM32Programming
 *
 *  Copyright 2015 - 2020 yangfuyuan
 *
 *
 */
#include "common.h"
#include "stm32_bootloader.h"
#include <math.h>
#include <stdio.h>
using namespace impl;

namespace stm32 {

STM32BootLoader *STM32BootLoader::_impl = NULL;

STM32BootLoader::STM32BootLoader():
  _serial(0) {
  isConnected = false;
  _baudrate = 115200;
  _parity   = serial::parity_none;
  _bytesize = serial::eightbits;
  _stopbits = serial::stopbits_one;
  _flowcontrol = serial::flowcontrol_none;
  m_flags = PORT_BYTE | PORT_GVR_ETX | PORT_CMD_INIT | PORT_RETRY;
}

STM32BootLoader::~STM32BootLoader() {
  ScopedLocker lock(serial_lock);

  if (_serial) {
    if (_serial->isOpen()) {
      _serial->close();
    }
  }

  if (_serial) {
    delete _serial;
    _serial = NULL;
  }
}


stm32_err_t STM32BootLoader::connect(const char *port_path, uint32_t baudrate,
                                     bytesize_t bytesize, parity_t parity, stopbits_t stopbits,
                                     flowcontrol_t flowcontrol) {
  _baudrate = baudrate;
  _bytesize = bytesize;
  _parity   = parity;
  _stopbits = stopbits;
  _flowcontrol = flowcontrol;
  {
    ScopedLocker lock(serial_lock);

    if (!_serial) {
      _serial = new serial::Serial(port_path, _baudrate,
                                   serial::Timeout::simpleTimeout(DEFAULT_TIMEOUT));
    }
  }


  {
    ScopedLocker lock(_lock);

    if (!_serial->open()) {
      return STM32_ERR_UNKNOWN;
    }

    _serial->setParity(parity);
    _serial->setBytesize(bytesize);
    _serial->setStopbits(stopbits);
    _serial->setFlowcontrol(flowcontrol);
    _serial->setDTR(1);
  }



  {
    isConnected = true;
  }


  return STM32_ERR_OK;
}


void STM32BootLoader::disconnect() {
  if (!isConnected) {
    return ;
  }

  ScopedLocker lock(serial_lock);

  if (_serial) {
    if (_serial->isOpen()) {
      _serial->close();
    }
  }

  isConnected = false;
}


stm32_err_t STM32BootLoader::sendData(const uint8_t *data, size_t size) {
  {
    if (!isConnected) {
      return STM32_ERR_UNKNOWN;
    }
  }

  if (data == NULL || size == 0) {
    return STM32_ERR_UNKNOWN;
  }

  size_t r = 0;

  while (size) {
    {
      if (_serial) {
        r = _serial->write(data, size);
      }
    }

    if (r < 1) {
      return STM32_ERR_UNKNOWN;
    }

    size -= r;
    data += r;
  }

  return STM32_ERR_OK;
}

stm32_err_t STM32BootLoader::getData(uint8_t *data, size_t size) {
  {
    if (!isConnected) {
      return STM32_ERR_UNKNOWN;
    }
  }
  size_t r = 0;

  while (size) {
    {
      if (_serial) {
        r = _serial->read(data, size);
      }
    }

    if (r == 0) {
      return STM32_ERR_TIMEOUT;
    }

    if (r < 0) {
      return STM32_ERR_UNKNOWN;
    }

    size -= r;
    data += r;

  }

  return STM32_ERR_OK;
}


stm32_err_t STM32BootLoader::waitForData(size_t data_count, uint32_t timeout,
    size_t *returned_size) {
  size_t length = 0;

  if (returned_size == NULL) {
    returned_size = (size_t *)&length;
  }

  int ret = -2;

  if (_serial) {
    ret = _serial->waitfordata(data_count, timeout, returned_size);
  }

  if (ret == 0) {
    return STM32_ERR_OK;
  } else if (ret == -1) {
    return STM32_ERR_TIMEOUT;
  } else {
    return STM32_ERR_UNKNOWN;
  }
}

std::string STM32BootLoader::getSDKVersion() {
  return SDKVerision;
}


//stm32 bootloader

stm32_err_t STM32BootLoader::stm32_send_init_seq(uint32_t timeout) {
  stm32_err_t ret;

  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t byte, cmd = STM32_CMD_INIT;

  {
    ScopedLocker lock(_lock);

    if (sendData(&cmd, 1) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }
  ret = getData(&byte, 1);

  if (ret == STM32_ERR_OK && byte == STM32_ACK) {
    return STM32_ERR_OK;
  }

  if (ret == STM32_ERR_OK && byte == STM32_NACK) {
    /* We could get error later, but let's continue, for now. */
    fprintf(stderr, "Warning: the interface was not closed properly.\n");
    sig("Warning: the interface was not closed properly.", 1);
    return STM32_ERR_OK;
  }

  if (ret != STM32_ERR_TIMEOUT) {
    fprintf(stderr, "Failed to init device.\n");
    return STM32_ERR_UNKNOWN;
  }

  sig("inti seq again.", 1);

  /*
   * Check if previous STM32_CMD_INIT was taken as first byte
   * of a command. Send a new byte, we should get back a NACK.
   */

  {
    ScopedLocker lock(_lock);

    if (sendData(&cmd, 1) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }
  ret = getData(&byte, 1);

  if (ret == STM32_ERR_OK && byte == STM32_NACK) {
    return STM32_ERR_OK;
  }

  fprintf(stderr, "Failed to init device.\n");
  sig("Failed to init device.", 2);
  return STM32_ERR_UNKNOWN;
}

stm32_err_t STM32BootLoader::stm32_send_command(const uint8_t cmd) {
  return stm32_send_command_timeout(cmd, 0);
}

stm32_err_t STM32BootLoader::stm32_send_command_timeout(const uint8_t cmd,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t ret;
  uint8_t buf[2];


  buf[0] = cmd;
  buf[1] = cmd ^ 0xFF;
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 2) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }

  ret = stm32_get_ack_timeout(timeout);

  if (ret == STM32_ERR_OK) {
    return STM32_ERR_OK;
  }

  if (ret == STM32_ERR_TIMEOUT) {
    fprintf(stderr, "Got NACK from device on command 0x%02x\n", cmd);
    char str[256];
    sprintf(str, "0x%02x.", cmd);
    sig("ot NACK from device on command " + string(str), 1);

  } else {
    char str[256];
    sprintf(str, "0x%02x.", cmd);
    fprintf(stderr, "Unexpected reply from device on command 0x%02x\n", cmd);
    sig("Unexpected reply from device on command " + string(str), 2);
  }

  return STM32_ERR_UNKNOWN;
}

