yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
stm32_err_t STM32BootLoader::stm32_send_command_adj(const uint8_t cmd,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t ret;
  uint8_t buf[2];

  buf[0] = cmd;
  buf[1] = cmd ^ 0xFF;
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 2) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }

  ret = stm32_get_ack_timeout(timeout);

  if (ret == STM32_ERR_OK) {
    return STM32_ERR_OK;
  }

  return STM32_ERR_UNKNOWN;
}

stm32_err_t STM32BootLoader::stm32_get_version(stm32_info &info,
    uint32_t current_speed, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t len, buf[3];

  if (stm32_send_command_adj(STM32_CMD_GVR, 0) == STM32_ERR_OK) {
    printf("succefful ACK/NACK at speed = %d\n", current_speed);
    /* From AN, only UART bootloader returns 3 bytes */
    len = (m_flags & PORT_GVR_ETX) ? 3 : 1;

    if (getData(buf, len) != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    info.version = buf[0];
    info.option1 = (m_flags & PORT_GVR_ETX) ? buf[1] : 0;
    info.option2 = (m_flags & PORT_GVR_ETX) ? buf[2] : 0;

    if (stm32_get_ack() != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    return STM32_ERR_OK;
  } else {
    return STM32_ERR_UNKNOWN;
  }
}

stm32_err_t STM32BootLoader::stm32_get_ack() {
  return stm32_get_ack_timeout(0);
}


stm32_err_t STM32BootLoader::stm32_get_ack_timeout(uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t byte;
  stm32_err_t ans;
  uint32_t startTs;
  uint32_t waitTime;

  if (!(m_flags & PORT_RETRY)) {
    timeout = 0;
  }

  if (timeout) {
    startTs = getms();
  }

  do {
    size_t remainSize = 1;
    size_t recvSize;

    if (timeout) {
      ans = waitForData(remainSize, timeout - waitTime, &recvSize);
    }

    if (ans == STM32_ERR_TIMEOUT && timeout) {
      if ((waitTime = (getms() - startTs)) <= timeout) {
        continue;
      }
    } else if (ans == STM32_ERR_UNKNOWN) {
      return STM32_ERR_UNKNOWN;
    }

    ans = getData(&byte, 1);

    if (ans == STM32_ERR_UNKNOWN) {
      return STM32_ERR_UNKNOWN;
    }

    if (byte == STM32_ACK) {
      return STM32_ERR_OK;
    }

    if (byte == STM32_NACK) {
      return STM32_ERR_NACK;
    }

    if (byte != STM32_BUSY) {
      return STM32_ERR_UNKNOWN;
    }

    return STM32_ERR_UNKNOWN;


  } while ((waitTime = (getms() - startTs)) <= timeout);

}


stm32_err_t STM32BootLoader::stm32_init(stm32_info &info, const char init,
                                        uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  if (info.cmd == NULL) {
    info.cmd = (stm32_cmd *)malloc(sizeof(stm32_cmd));
    memset(info.cmd, STM32_CMD_ERR, sizeof(stm32_cmd));
  }

  uint8_t len, val, buf[257];
  int new_cmds;

  if ((m_flags & PORT_CMD_INIT) && init)
    if (stm32_send_init_seq() != STM32_ERR_OK) {
      printf("VM: stm32_send_init_seq failed\n");
      sig("stm32_send_init_seq failed.", 2);

    }

  /* get the version and read protection status  */
  if (stm32_send_command(STM32_CMD_GVR) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  /* From AN, only UART bootloader returns 3 bytes */
  len = (m_flags & PORT_GVR_ETX) ? 3 : 1;

  stm32_err_t ans = getData(buf, len);

  if (ans != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  info.version = buf[0];
  info.option1 = (m_flags & PORT_GVR_ETX) ? buf[1] : 0;
  info.option2 = (m_flags & PORT_GVR_ETX) ? buf[2] : 0;

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;

  }


  /* get the bootloader information */
  len = STM32_CMD_GET_LENGTH;

  if (stm32_guess_len_cmd(STM32_CMD_GET, buf, len) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  len = buf[0] + 1;
  info.bl_version = buf[1];
  new_cmds = 0;

  for (int i = 1; i < len; i++) {
    val = buf[i + 1];

    switch (val) {
      case STM32_CMD_GET:
        info.cmd->get = val;
        break;

      case STM32_CMD_GVR:
        info.cmd->gvr = val;
        break;

      case STM32_CMD_GID:
        info.cmd->gid = val;
        break;

      case STM32_CMD_RM:
        info.cmd->rm = val;
        break;

      case STM32_CMD_GO:
        info.cmd->go = val;
        break;

      case STM32_CMD_WM:
      case STM32_CMD_WM_NS:
        info.cmd->wm = newer(info.cmd->wm, val);
        break;

      case STM32_CMD_ER:
      case STM32_CMD_EE:
      case STM32_CMD_EE_NS:
        info.cmd->er = newer(info.cmd->er, val);
        break;

      case STM32_CMD_WP:
      case STM32_CMD_WP_NS:
        info.cmd->wp = newer(info.cmd->wp, val);
        break;

      case STM32_CMD_UW:
      case STM32_CMD_UW_NS:
        info.cmd->uw = newer(info.cmd->uw, val);
        break;

      case STM32_CMD_RP:
      case STM32_CMD_RP_NS:
        info.cmd->rp = newer(info.cmd->rp, val);
        break;

      case STM32_CMD_UR:
      case STM32_CMD_UR_NS:
        info.cmd->ur = newer(info.cmd->ur, val);
        break;

      case STM32_CMD_CRC:
        info.cmd->crc = newer(info.cmd->crc, val);
        break;

      default:
        if (new_cmds++ == 0) {
          fprintf(stderr, "GET returns unknown commands (0x%2x", val);
        } else {
          fprintf(stderr, ", 0x%2x", val);
        }
    }
  }


  if (new_cmds) {
    fprintf(stderr, ")\n");
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;

  }

  if (info.cmd->get == STM32_CMD_ERR || info.cmd->gvr == STM32_CMD_ERR ||
      info.cmd->gid == STM32_CMD_ERR) {
    fprintf(stderr,
            "Error: bootloader did not returned correct information from GET command\n");
    sig("bootloader did not returned correct information from GET command.", 2);

    return STM32_ERR_UNKNOWN;
  }

  /* get the device ID */
  if (stm32_guess_len_cmd(info.cmd->gid, buf, 1) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  len = buf[0] + 1;

  if (len < 2) {
    fprintf(stderr, "Only %d bytes sent in the PID, unknown/unsupported device\n",
            len);
    sig("Only %d bytes sent in the PID, unknown/unsupported device.", 2);
    return STM32_ERR_UNKNOWN;
  }

