yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
  info.pid = (buf[1] << 8) | buf[2];

  if (len > 2) {
    fprintf(stderr, "This bootloader returns %d extra bytes in PID:", len);

    for (int i = 2; i <= len ; i++) {
      fprintf(stderr, " %02x", buf[i]);
    }

    fprintf(stderr, "\n");
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  info.dev = devices;

  while (info.dev->id != 0x00 && info.dev->id != info.pid) {
    ++info.dev;
  }

  if (!info.dev->id) {
    fprintf(stderr, "Unknown/unsupported device (Device ID: 0x%03x)\n", info.pid);
    char str[255];
    sprintf(str, "0x%03x).", info.pid);
    sig("Unknown/unsupported device (Device ID: " + string(str), 2);
    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;




}

stm32_err_t STM32BootLoader::stm32_guess_len_cmd(uint8_t cmd, uint8_t *data,
    unsigned int len, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  if (stm32_send_command(cmd) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t ret;

  if (m_flags & PORT_BYTE) {
    /* interface is UART-like */
    ret = getData(data, 1);

    if (ret != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    len = data[0];
    ret = getData(data + 1, len + 1);

    if (ret != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    return STM32_ERR_OK;

  }

  ret = getData(data, len + 2);

  if (ret == STM32_ERR_OK && len == data[0]) {
    return STM32_ERR_OK;
  }

  if (ret != STM32_ERR_OK) {
    /* restart with only one byte */
    if (stm32_resync(STM32_RESYNC_TIMEOUT * 1000) != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    if (stm32_send_command(cmd) != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

    ret = getData(data, 1);

    if (ret != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }

  }


  fprintf(stderr, "Re sync (len = %d)\n", data[0]);

  if (stm32_resync(STM32_RESYNC_TIMEOUT * 1000) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  len = data[0];

  if (stm32_send_command(cmd) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  ret = getData(data, len + 2);

  if (ret != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;
}

stm32_err_t STM32BootLoader::stm32_resync(uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t ret;
  uint8_t buf[2], ack;

  buf[0] = STM32_CMD_ERR;
  buf[1] = STM32_CMD_ERR ^ 0xFF;

  uint32_t startTs = getms();
  uint32_t waitTime;

  while ((waitTime = (getms() - startTs)) <= timeout) {
    {
      ScopedLocker lock(_lock);

      if (sendData(buf, 2) != STM32_ERR_OK) {
        fprintf(stderr, "Failed to send command\n");
        usleep(500000);
        continue;
      }
    }
    ret = getData(&ack, 1);

    if (ret != STM32_ERR_OK) {
      continue;
    }

    if (ack == STM32_NACK) {
      return STM32_ERR_OK;
    }


  }

  return STM32_ERR_UNKNOWN;
}

stm32_err_t STM32BootLoader::stm32_read_memory(const stm32_info &info,
    uint32_t address, uint8_t *data, unsigned int len, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t buf[5];

  if (!len) {
    return STM32_ERR_OK;
  }

  if (len > 256) {
    fprintf(stderr, "Error: READ length limit at 256 bytes\n");
    sig("READ length limit at 256 bytes.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (info.cmd->rm == STM32_CMD_ERR) {
    fprintf(stderr, "Error: READ command not implemented in bootloader.\n");
    sig("READ command not implemented in bootloader.", 2);
    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->rm) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  buf[0] = address >> 24;
  buf[1] = (address >> 16) & 0xFF;
  buf[2] = (address >> 8) & 0xFF;
  buf[3] = address & 0xFF;
  buf[4] = buf[0] ^ buf[1] ^ buf[2] ^ buf[3];

  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 5) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  if (stm32_send_command(len - 1) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  {

    if (getData(data, len) != STM32_ERR_OK) {
      return STM32_ERR_UNKNOWN;
    }
  }


  return STM32_ERR_OK;

}

stm32_err_t STM32BootLoader::stm32_write_memory(const stm32_info &info,
    uint32_t address, const uint8_t *data, unsigned int len, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t cs, buf[256 + 2];
  unsigned int i, aligned_len;
  stm32_err_t s_err;

  if (!len) {
    return STM32_ERR_OK;
  }

  if (len > 256) {
    sig("READ length limit at 256 bytes.", 2);
    fprintf(stderr, "Error: READ length limit at 256 bytes\n");
    return STM32_ERR_UNKNOWN;
  }

  /* must be 32bit aligned */
  if (address & 0x3) {
    sig("WRITE address must be 4 byte aligned.", 2);
    fprintf(stderr, "Error: WRITE address must be 4 byte aligned\n");
    return STM32_ERR_UNKNOWN;
  }

  if (info.cmd->wm == STM32_CMD_ERR) {
    sig("WRITE command not implemented in bootloader.", 2);
    fprintf(stderr, "Error: WRITE command not implemented in bootloader.\n");
    return STM32_ERR_NO_CMD;
  }

  /* send the address and checksum */
  if (stm32_send_command(info.cmd->wm) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  buf[0] = address >> 24;
  buf[1] = (address >> 16) & 0xFF;
  buf[2] = (address >> 8) & 0xFF;
  buf[3] = address & 0xFF;
  buf[4] = buf[0] ^ buf[1] ^ buf[2] ^ buf[3];

  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 5) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  aligned_len = (len + 3) & ~3;
  cs = aligned_len - 1;
  buf[0] = aligned_len - 1;

  for (i = 0; i < len; i++) {
    cs ^= data[i];
    buf[i + 1] = data[i];
  }

  /* padding data */
  for (i = len; i < aligned_len; i++) {
    cs ^= 0xFF;
    buf[i + 1] = 0xFF;
  }

