yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
  buf[aligned_len + 1] = cs;
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, aligned_len + 2) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }

  }

  s_err = stm32_get_ack_timeout(STM32_BLKWRITE_TIMEOUT * 1000);

  if (s_err != STM32_ERR_OK) {
    if (m_flags & PORT_STRETCH_W
        && info.cmd->wm != STM32_CMD_WM_NS) {
      stm32_warn_stretching("write");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_wunprot_memory(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;

  if (info.cmd->uw == STM32_CMD_ERR) {
    fprintf(stderr,
            "Error: WRITE UNPROTECT command not implemented in bootloader.\n");
    sig("WRITE UNPROTECT command not implemented in bootloader.", 2);

    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->uw) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  s_err = stm32_get_ack_timeout(STM32_WUNPROT_TIMEOUT * 1000);

  if (s_err == STM32_ERR_TIMEOUT) {
    fprintf(stderr, "Error: Failed to WRITE UNPROTECT\n");
    sig("Failed to WRITE UNPROTECT.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (s_err != STM32_ERR_OK) {
    if (m_flags & PORT_STRETCH_W
        && info.cmd->uw != STM32_CMD_UW_NS) {
      stm32_warn_stretching("WRITE UNPROTECT");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_wprot_memory(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;

  if (info.cmd->wp == STM32_CMD_ERR) {
    fprintf(stderr,
            "Error: WRITE PROTECT command not implemented in bootloader.\n");
    sig("WRITE PROTECT command not implemented in bootloader.", 2);
    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->wp) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  s_err = stm32_get_ack_timeout(STM32_WPROT_TIMEOUT * 1000);

  if (s_err == STM32_ERR_TIMEOUT) {
    fprintf(stderr, "Error: Failed to WRITE PROTECT\n");
    sig("Failed to WRITE PROTECT.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (s_err != STM32_ERR_OK) {
    if (m_flags & PORT_STRETCH_W
        && info.cmd->wp != STM32_CMD_WP_NS) {
      stm32_warn_stretching("WRITE PROTECT");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_runprot_memory(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;

  if (info.cmd->ur == STM32_CMD_ERR) {
    fprintf(stderr,
            "Error: READOUT UNPROTECT command not implemented in bootloader.\n");
    sig("READOUT UNPROTECT command not implemented in bootloader.", 2);

    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->ur) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  s_err = stm32_get_ack_timeout(STM32_MASSERASE_TIMEOUT * 1000);

  if (s_err == STM32_ERR_TIMEOUT) {
    sig("Failed to READOUT UNPROTECT.", 2);

    fprintf(stderr, "Error: Failed to READOUT UNPROTECT\n");
    return STM32_ERR_UNKNOWN;
  }

  if (s_err != STM32_ERR_OK) {
    if (m_flags & PORT_STRETCH_W
        && info.cmd->ur != STM32_CMD_UR_NS) {
      stm32_warn_stretching("READOUT UNPROTECT");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_readprot_memory(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;

  if (info.cmd->rp == STM32_CMD_ERR) {
    fprintf(stderr,
            "Error: READOUT PROTECT command not implemented in bootloader.\n");
    sig("READOUT PROTECT command not implemented in bootloader.", 2);
    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->rp) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  s_err = stm32_get_ack_timeout(STM32_RPROT_TIMEOUT * 1000);

  if (s_err == STM32_ERR_TIMEOUT) {
    fprintf(stderr, "Error: Failed to READOUT PROTECT\n");
    sig("Failed to READOUT PROTECT.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (s_err != STM32_ERR_OK) {
    if (m_flags & PORT_STRETCH_W
        && info.cmd->rp != STM32_CMD_RP_NS) {
      stm32_warn_stretching("READOUT PROTECT");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_mass_erase(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;
  uint8_t buf[3];

  if (stm32_send_command(info.cmd->er) != STM32_ERR_OK) {
    fprintf(stderr, "Can't initiate chip mass erase!\n");
    sig("Can't initiate chip mass erase.", 2);
    return STM32_ERR_UNKNOWN;
  }

  /* regular erase (0x43) */
  if (info.cmd->er == STM32_CMD_ER) {
    s_err = stm32_send_command_timeout(0xFF, STM32_MASSERASE_TIMEOUT * 1000);

    if (s_err != STM32_ERR_OK) {
      if (m_flags & PORT_STRETCH_W) {
        stm32_warn_stretching("mass erase");
      }

      return STM32_ERR_UNKNOWN;
    }

    return STM32_ERR_OK;
  }

  /* extended erase */
  buf[0] = 0xFF;	/* 0xFFFF the magic number for mass erase */
  buf[1] = 0xFF;
  buf[2] = 0x00;  /* checksum */
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 3) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }

  }
  s_err = stm32_get_ack_timeout(STM32_MASSERASE_TIMEOUT * 1000);

  if (s_err != STM32_ERR_OK) {
    fprintf(stderr,
            "Mass erase failed. Try specifying the number of pages to be erased.\n");
    sig("Mass erase failed. Try specifying the number of pages to be erased.", 2);

    if (m_flags & PORT_STRETCH_W
        && info.cmd->er != STM32_CMD_EE_NS) {
      stm32_warn_stretching("mass erase");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

