yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
}
stm32_err_t STM32BootLoader::stm32_pages_erase(const stm32_info &info,
    uint32_t spage, uint32_t pages, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  stm32_err_t s_err;
  uint32_t pg_num;
  uint8_t pg_byte;
  uint8_t cs = 0;
  uint8_t *buf;
  int i = 0;

  /* The erase command reported by the bootloader is either 0x43, 0x44 or 0x45 */
  /* 0x44 is Extended Erase, a 2 byte based protocol and needs to be handled differently. */
  /* 0x45 is clock no-stretching version of Extended Erase for I2C port. */
  if (stm32_send_command(info.cmd->er) != STM32_ERR_OK) {
    fprintf(stderr, "Can't initiate chip mass erase!\n");
    sig("Can't initiate chip mass erase.", 2);

    return STM32_ERR_UNKNOWN;
  }

  /* regular erase (0x43) */
  if (info.cmd->er == STM32_CMD_ER) {
    buf = (uint8_t *)malloc(1 + pages + 1);

    if (!buf) {
      return STM32_ERR_UNKNOWN;
    }

    buf[i++] = pages - 1;
    cs ^= (pages - 1);

    for (pg_num = spage; pg_num < (pages + spage); pg_num++) {
      buf[i++] = pg_num;
      cs ^= pg_num;
    }

    buf[i++] = cs;
    {
      ScopedLocker lock(_lock);

      if (sendData(buf, i) != STM32_ERR_OK) {
        free(buf);
        fprintf(stderr, "Failed to send command\n");
        return STM32_ERR_UNKNOWN;
      }
    }
    free(buf);

    s_err = stm32_get_ack_timeout(pages * STM32_PAGEERASE_TIMEOUT * 1000);

    if (s_err != STM32_ERR_OK) {
      if (m_flags & PORT_STRETCH_W) {
        stm32_warn_stretching("erase");
      }

      return STM32_ERR_UNKNOWN;
    }

    return STM32_ERR_OK;
  }

  /* extended erase */
  buf = (uint8_t *)malloc(2 + 2 * pages + 1);

  if (!buf) {
    return STM32_ERR_UNKNOWN;
  }

  /* Number of pages to be erased - 1, two bytes, MSB first */
  pg_byte = (pages - 1) >> 8;
  buf[i++] = pg_byte;
  cs ^= pg_byte;
  pg_byte = (pages - 1) & 0xFF;
  buf[i++] = pg_byte;
  cs ^= pg_byte;

  for (pg_num = spage; pg_num < spage + pages; pg_num++) {
    pg_byte = pg_num >> 8;
    cs ^= pg_byte;
    buf[i++] = pg_byte;
    pg_byte = pg_num & 0xFF;
    cs ^= pg_byte;
    buf[i++] = pg_byte;
  }

  buf[i++] = cs;
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, i) != STM32_ERR_OK) {
      free(buf);
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }
  free(buf);


  s_err = stm32_get_ack_timeout(pages * STM32_PAGEERASE_TIMEOUT * 1000);

  if (s_err != STM32_ERR_OK) {
    fprintf(stderr,
            "Page-by-page erase failed. Check the maximum pages your device supports.\n");
    sig("Page-by-page erase failed. Check the maximum pages your device supports.",
        2);

    if (m_flags & PORT_STRETCH_W
        && info.cmd->er != STM32_CMD_EE_NS) {
      stm32_warn_stretching("erase");
    }

    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_erase_memory(const stm32_info &info,
    uint32_t spage, uint32_t pages, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint32_t n;
  stm32_err_t s_err;

  if (!pages || spage > STM32_MAX_PAGES ||
      ((pages != STM32_MASS_ERASE) && ((spage + pages) > STM32_MAX_PAGES))) {
    return STM32_ERR_OK;
  }

  if (info.cmd->er == STM32_CMD_ERR) {
    fprintf(stderr, "Error: ERASE command not implemented in bootloader.\n");
    sig("ERASE command not implemented in bootloader.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (pages == STM32_MASS_ERASE) {
    /*
     * Not all chips support mass erase.
     * Mass erase can be obtained executing a "readout protect"
     * followed by "readout un-protect". This method is not
     * suggested because can hang the target if a debug SWD/JTAG
     * is connected. When the target enters in "readout
     * protection" mode it will consider the debug connection as
     * a tentative of intrusion and will hang.
     * Erasing the flash page-by-page is the safer way to go.
     */
    if (!(info.dev->flags & F_NO_ME)) {
      return stm32_mass_erase(info);
    }

    pages = flash_addr_to_page_ceil(info, info.dev->fl_end);
  }

  /*
   * Some device, like STM32L152, cannot erase more than 512 pages in
   * one command. Split the call.
   */
  while (pages) {
    n = (pages <= 512) ? pages : 512;
    s_err = stm32_pages_erase(info, spage, n, timeout);

    if (s_err != STM32_ERR_OK) {
      return s_err;
    }

    spage += n;
    pages -= n;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_run_raw_code(const stm32_info &info,
    uint32_t target_address, const uint8_t *code, uint32_t code_size,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint32_t stack_le = le_u32(0x20002000);
  uint32_t code_address_le = le_u32(target_address + 8 +
                                    1); // thumb mode address (!)
  uint32_t length = code_size + 8;
  uint8_t *mem, *pos;
  uint32_t address, w;

  /* Must be 32-bit aligned */
  if (target_address & 0x3) {
    fprintf(stderr, "Error: code address must be 4 byte aligned\n");
    sig("code address must be 4 byte aligned.", 2);
    return STM32_ERR_UNKNOWN;
  }

  mem = (uint8_t *)malloc(length);

  if (!mem) {
    return STM32_ERR_UNKNOWN;
  }

  memcpy(mem, &stack_le, sizeof(uint32_t));
  memcpy(mem + 4, &code_address_le, sizeof(uint32_t));
  memcpy(mem + 8, code, code_size);

  pos = mem;
  address = target_address;

  while (length > 0) {
    w = length > 256 ? 256 : length;

    if (stm32_write_memory(info, address, pos, w) != STM32_ERR_OK) {
      free(mem);
      return STM32_ERR_UNKNOWN;
    }

    address += w;
    pos += w;
    length -= w;
  }

  free(mem);
  return stm32_go(info, target_address, timeout);

}
stm32_err_t STM32BootLoader::stm32_go(const stm32_info &info, uint32_t address,
                                      uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t buf[5];

  if (info.cmd == NULL) {
    fprintf(stderr, "Error: null cmd pointer.\n");
    return STM32_ERR_UNKNOWN;
  }

