yangfuyuan/STM32Programming/sdk/src/stm32_bootloader.cpp
  if (info.cmd->go == STM32_CMD_ERR) {
    fprintf(stderr, "Error: GO command not implemented in bootloader.\n");
    sig(" GO command not implemented in bootloader.", 2);

    return STM32_ERR_NO_CMD;
  }


  if (stm32_send_command(info.cmd->go) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }


  buf[0] = address >> 24;
  buf[1] = (address >> 16) & 0xFF;
  buf[2] = (address >> 8) & 0xFF;
  buf[3] = address & 0xFF;
  buf[4] = buf[0] ^ buf[1] ^ buf[2] ^ buf[3];

  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 5) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }

  }


  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  return STM32_ERR_OK;

}
stm32_err_t STM32BootLoader::stm32_reset_device(const stm32_info &info,
    uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint32_t target_address = info.dev->ram_start;

  if (info.dev->flags & F_OBLL) {
    /* set the OBL_LAUNCH bit to reset device (see RM0360, 2.5) */
    return stm32_run_raw_code(info, target_address, stm_obl_launch_code,
                              stm_obl_launch_code_length, timeout);

  } else {
    return stm32_run_raw_code(info, target_address, stm_reset_code,
                              stm_reset_code_length, timeout);

  }

}
stm32_err_t STM32BootLoader::stm32_crc_memory(const stm32_info &info,
    uint32_t address, uint32_t length, uint32_t *crc, uint32_t timeout) {
  if (!isConnected) {
    return STM32_ERR_UNKNOWN;
  }

  uint8_t buf[5];

  if (address & 0x3 || length & 0x3) {
    fprintf(stderr, "Start and end addresses must be 4 byte aligned\n");
    sig("Start and end addresses must be 4 byte aligned.", 2);

    return STM32_ERR_UNKNOWN;
  }

  if (info.cmd->crc == STM32_CMD_ERR) {
    fprintf(stderr, "Error: CRC command not implemented in bootloader.\n");
    sig("CRC command not implemented in bootloader.", 2);

    return STM32_ERR_NO_CMD;
  }

  if (stm32_send_command(info.cmd->crc) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  buf[0] = address >> 24;
  buf[1] = (address >> 16) & 0xFF;
  buf[2] = (address >> 8) & 0xFF;
  buf[3] = address & 0xFF;
  buf[4] = buf[0] ^ buf[1] ^ buf[2] ^ buf[3];
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 5) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  buf[0] = length >> 24;
  buf[1] = (length >> 16) & 0xFF;
  buf[2] = (length >> 8) & 0xFF;
  buf[3] = length & 0xFF;
  buf[4] = buf[0] ^ buf[1] ^ buf[2] ^ buf[3];
  {
    ScopedLocker lock(_lock);

    if (sendData(buf, 5) != STM32_ERR_OK) {
      fprintf(stderr, "Failed to send command\n");
      return STM32_ERR_UNKNOWN;
    }

  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  if (stm32_get_ack() != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  if (getData(buf, 5) != STM32_ERR_OK) {
    return STM32_ERR_UNKNOWN;
  }

  if (buf[4] != (buf[0] ^ buf[1] ^ buf[2] ^ buf[3])) {
    return STM32_ERR_UNKNOWN;
  }

  *crc = (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3];
  return STM32_ERR_OK;

}
uint32_t STM32BootLoader::stm32_sw_crc(uint32_t crc, uint8_t *buf,
                                       unsigned int len) {
  int i;
  uint32_t data;

  if (len & 0x3) {
    fprintf(stderr, "Buffer length must be multiple of 4 bytes\n");
    return 0;
  }

  while (len) {
    data = *buf++;
    data |= *buf++ << 8;
    data |= *buf++ << 16;
    data |= *buf++ << 24;
    len -= 4;

    crc ^= data;

    for (i = 0; i < 32; i++)
      if (crc & CRC_MSBMASK) {
        crc = (crc << 1) ^ CRCPOLY_BE;
      } else {
        crc = (crc << 1);
      }
  }

  return crc;
}
stm32_err_t STM32BootLoader::stm32_crc_wrapper(const stm32_info &info,
    uint32_t address, uint32_t length, uint32_t *crc, uint32_t timeout) {
  uint8_t buf[256];
  uint32_t start, total_len, len, current_crc;

  if (address & 0x3 || length & 0x3) {
    fprintf(stderr, "Start and end addresses must be 4 byte aligned\n");
    sig("Start and end addresses must be 4 byte aligned.", 2);
    return STM32_ERR_UNKNOWN;
  }

  if (info.cmd->crc != STM32_CMD_ERR) {
    return stm32_crc_memory(info, address, length, crc);
  }

  start = address;
  total_len = length;
  current_crc = CRC_INIT_VALUE;

  while (length) {
    len = length > 256 ? 256 : length;

    if (stm32_read_memory(info, address, buf, len) != STM32_ERR_OK) {
      fprintf(stderr,
              "Failed to read memory at address 0x%08x, target write-protected?\n",
              address);
      sig("Failed to read memory at address 0x%08x, target write-protected.", 2);
      return STM32_ERR_UNKNOWN;
    }

    current_crc = stm32_sw_crc(current_crc, buf, len);
    length -= len;
    address += len;

    fprintf(stderr,
            "\rCRC address 0x%08x (%.2f%%) ",
            address,
            (100.0f / (float)total_len) * (float)(address - start)
           );
    fflush(stderr);
  }

  fprintf(stderr, "Done.\n");
  *crc = current_crc;
  return STM32_ERR_OK;

}

}
